refactor: ajusta path do projeto e documentação
